We're seeing the same issue. The whole influxdb instance gets recreated when simply updating allocated_storage, or anything for that matter. Using Atlantis.

- hashicop/aws v5.96.0

- v0.27.2 (commit: 2991920) (build date: 2024-03-08T21:57:57.207Z) of atlantis

Plan output: 
```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_timestreaminfluxdb_db_instance.this must be replaced
-/+ resource "aws_timestreaminfluxdb_db_instance" "this" {
!       allocated_storage                 = 100 -> 150
!       arn                               = "arn:aws:timestream-influxdb:eu-west-1:xxx:db-instance/xxx" -> (known after apply)
!       availability_zone                 = "eu-west-1c" -> (known after apply)
!       db_storage_type                   = "InfluxIOIncludedT1" -> (known after apply)
!       deployment_type                   = "SINGLE_AZ" -> (known after apply)
!       endpoint                          = "prod-xxx-xxx.eu-west-1.timestream-influxdb.amazonaws.com" -> (known after apply)
!       id                                = "xxx" -> (known after apply)
!       influx_auth_parameters_secret_arn = "arn:aws:secretsmanager:eu-west-1:xxx:secret:READONLY-InfluxDB-auth-parameters-xxx-xxx" -> (known after apply)
        name                              = "prod-xxx"
+       network_type                      = (known after apply) # forces replacement
!       password                          = (sensitive value)
!       port                              = 8086 -> (known after apply)
+       secondary_availability_zone       = (known after apply)
        tags                              = {
            "application" = "aaa"
            "owner"       = "ooo"
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```